Documents/ЕГИССО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ЕГИССО</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЖурналЗаполненияЕГИССО</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипЕГИССО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕГИССО_ДанныеКатегорий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчебныйГод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Таблица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Обучающийся</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Родители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LMSZID</Name>
							<Comment>Идентификатор назначенной МСЗ</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>categoryID</Name>
							<Comment>Идентификатор локальной¶категории получателей МСЗ</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SNILS_recip</Name>
							<Comment>СНИЛС</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FamilyName_recip</Name>
							<Comment>Фамилия</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Name_recip</Name>
							<Comment>Имя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Patronymic_recip</Name>
							<Comment>Отчество</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Gender_recip</Name>
							<Comment>Пол</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.Gender_recip</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BirthDate_recip</Name>
							<Comment>Дата рождения</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>doctype_recip</Name>
							<Comment>Тип документа</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>doc_Series_recip</Name>
							<Comment>Серия</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>doc_Number_recip</Name>
							<Comment>Номер</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>6</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>doc_IssueDate_recip</Name>
							<Comment>Дата выдачи</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>doc_Issuer_recip</Name>
							<Comment>Кем выдан</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SNILS_reason</Name>
							<Comment>СНИЛС</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FamilyName_reason</Name>
							<Comment>Фамилия</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Name_reason</Name>
							<Comment>Имя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Patronymic_reason</Name>
							<Comment>Отчество</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Gender_reason</Name>
							<Comment>Пол</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.Gender_recip</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BirthDate_reason</Name>
							<Comment>Дата рождения</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>doctype_reason</Name>
							<Comment>Тип документа</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>doc_Series_reason</Name>
							<Comment>Серия</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>doc_Number_reason</Name>
							<Comment>Номер</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>6</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>doc_IssueDate_reason</Name>
							<Comment>Дата выдачи</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>doc_Issuer_reason</Name>
							<Comment>Кем выдан</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>decision_date</Name>
							<Comment>Дата принятия решения о назначении</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>dateStart</Name>
							<Comment>Дата начала действия назначения</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>dateFinish</Name>
							<Comment>Дата окончания действия назначения</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>usingSign</Name>
							<Comment>Признак использования¶критериев нуждаемости при¶назначении МСЗ</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.usingSign</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>criteria</Name>
							<Comment>Перечень использованных¶критериев нуждаемости</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FormCode</Name>
							<Comment>Код формы предоставления из¶справочника форм¶предоставления КМСЗ</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>measuryCode</Name>
							<Comment>Код единицы измерения по¶справочнику ЕГИССО</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>monetization</Name>
							<Comment>Признак монетизации</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>content</Name>
							<Comment>Содержание</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>comment</Name>
							<Comment>Комментарий</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>equivalentAmount</Name>
							<Comment>дубль amount</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДвиженияОбучающихся.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ДвиженияОбучающихся</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Классы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчебныйГод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГода</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчислен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДвиженияОбучающегося</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Условно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Пол.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>Пол</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОпределен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Gender_recip.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>Gender_recip</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>М</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ж</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Документы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>Документы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПаспортГражданинаРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СвидетельствоОРождении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Иное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЕГИССО/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьОбучающихся(Команда)
	ЗаполнитьОбучающихсяНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбучающихсяНаСервере()
	
	ЗапросТипЕГИССО = Новый Запрос("ВЫБРАТЬ
	                               |	ЕГИССО_ДанныеКатегорий.Наименование КАК Наименование,
	                               |	ЕГИССО_ДанныеКатегорий.LMSZID КАК LMSZID,
	                               |	ЕГИССО_ДанныеКатегорий.FormCode КАК FormCode,
	                               |	ЕГИССО_ДанныеКатегорий.amount КАК amount,
	                               |	ЕГИССО_ДанныеКатегорий.ТипЛьготы КАК ТипЛьготы,
	                               |	ЕГИССО_ДанныеКатегорий.categoryID.(
	                               |		Ссылка КАК Ссылка,
	                               |		НомерСтроки КАК НомерСтроки,
	                               |		Категория КАК Категория,
	                               |		Значение КАК Значение
	                               |	) КАК categoryID,
	                               |	ЕГИССО_ДанныеКатегорий.Ссылка КАК Ссылка,
	                               |	ЕГИССО_ДанныеКатегорий.measuryCode КАК measuryCode
	                               |ИЗ
	                               |	Справочник.ЕГИССО_ДанныеКатегорий КАК ЕГИССО_ДанныеКатегорий
	                               |ГДЕ
	                               |	ЕГИССО_ДанныеКатегорий.Ссылка = &Категория");
	ЗапросТипЕГИССО.УстановитьПараметр("Категория",Объект.ТипЕГИССО);
	КатегорияЕГИССО = ЗапросТипЕГИССО.Выполнить().Выбрать();
	Если НЕ КатегорияЕГИССО.Следующий() Тогда
		Сообщить("Не найден выбранный тип отчета ЕГИССО");
		Возврат;
	КонецЕсли;
	categoryID = КатегорияЕГИССО.categoryID.Выгрузить();
	
	ЗапросОбучающиеся = Новый Запрос("ВЫБРАТЬ
	                                 |	ДвиженияОбучающихсяСрезПоследних.Обучающийся КАК Обучающийся,
	                                 |	ДвиженияОбучающихсяСрезПоследних.Класс КАК Класс,
	                                 |	ОбучающиесяЛьготы.Заявитель КАК Заявитель,
	                                 |	ОбучающиесяЛьготы.ДатаПриказа КАК ДатаПриказа,
	                                 |	ОбучающиесяЛьготы.Начало КАК Начало,
	                                 |	ОбучающиесяЛьготы.Окончание КАК Окончание,
	                                 |	ОбучающиесяЛьготы.НаименованиеЛьготы КАК НаименованиеЛьготы,
	                                 |	ОбучающиесяЛьготы.Категория КАК Категория
	                                 |ИЗ
	                                 |	РегистрСведений.ДвиженияОбучающихся.СрезПоследних(&Дата, Отчислен = ЛОЖЬ) КАК ДвиженияОбучающихсяСрезПоследних
	                                 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Обучающиеся.Льготы КАК ОбучающиесяЛьготы
	                                 |		ПО ДвиженияОбучающихсяСрезПоследних.Обучающийся = ОбучающиесяЛьготы.Ссылка
									 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналЗаполненияЕГИССО.СрезПоследних(&Дата,
									 |																			ТипЕГИССО=&ТипЕГИССО И
									 |																			УчебныйГод=&УчебныйГод) КАК ЖурналЕГИССО
									 |		ПО ЖурналЕГИССО.Обучающийся = ДвиженияОбучающихсяСрезПоследних.Обучающийся
	                                 |ГДЕ
									 |	ЕСТЬNULL(ЖурналЕГИССО.Обучающийся, 0) = 0
	                                 |	И ОбучающиесяЛьготы.Начало МЕЖДУ &НачалоПериода И &КонецПериода
	                                 |	И ОбучающиесяЛьготы.НаименованиеЛьготы = &ТипЛьготы");
	ЗапросОбучающиеся.УстановитьПараметр("Дата",Объект.Дата);
	ЗапросОбучающиеся.УстановитьПараметр("НачалоПериода",Объект.УчебныйГод.Начало);
	ЗапросОбучающиеся.УстановитьПараметр("КонецПериода",Объект.УчебныйГод.Окончание);
	ЗапросОбучающиеся.УстановитьПараметр("ТипЛьготы",КатегорияЕГИССО.ТипЛьготы); 
	ЗапросОбучающиеся.УстановитьПараметр("ТипЕГИССО",КатегорияЕГИССО.Ссылка);
	ЗапросОбучающиеся.УстановитьПараметр("УчебныйГод",Объект.УчебныйГод);

	
	Выборка = ЗапросОбучающиеся.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		ФИО_Обуч = ПолучитьФИО(Выборка.Обучающийся.Наименование);
		ФИО_Родитель = ПолучитьФИО(Выборка.Заявитель.Наименование);
		Строка = Объект.Таблица.Добавить();
		
		Строка.Обучающийся = Выборка.Обучающийся;
		Строка.Родитель = Выборка.Заявитель;
		
		Строка.LMSZID = КатегорияЕГИССО.LMSZID;                  
		ОтборКатегории = Новый Структура("Категория",Выборка.Категория);
		НайденныеСтроки = categoryID.НайтиСтроки(ОтборКатегории); 
		Строка.categoryID = НайденныеСтроки[0].Значение;
		Строка.SNILS_recip = Выборка.Заявитель.СНИЛС; 
		Строка.FamilyName_recip = ФИО_Родитель.Фамилия; 
		Строка.Name_recip = ФИО_Родитель.Имя;
		Строка.Patronymic_recip = ФИО_Родитель.Отчество;
		Если Выборка.Заявитель.Пол = Перечисления.Пол.Мужской Тогда
			Строка.Gender_recip = Перечисления.Gender_recip.М;
		ИначеЕсли Выборка.Заявитель.Пол = Перечисления.Пол.Женский Тогда 
			Строка.Gender_recip = Перечисления.Gender_recip.Ж; 
		КонецЕсли; 
		Строка.BirthDate_recip = Выборка.Заявитель.ДатаРождения;
		Строка.doctype_recip = "03";
		Строка.doc_Series_recip = Выборка.Заявитель.ДокументСерия;
		Строка.doc_Number_recip = Выборка.Заявитель.ДокументНомер;
		Строка.doc_IssueDate_recip = Выборка.Заявитель.ДокументДатаВыдачи; 
		Строка.doc_Issuer_recip = Выборка.Заявитель.ДокументВыдан; 
		Строка.SNILS_reason = Выборка.Обучающийся.СНИЛС; 
		Строка.FamilyName_reason = ФИО_Обуч.Фамилия;
		Строка.Name_reason = ФИО_Обуч.Имя;
		Строка.Patronymic_reason = ФИО_Обуч.Отчество;
		Если Выборка.Обучающийся.Пол = Перечисления.Пол.Мужской Тогда
			Строка.Gender_reason = Перечисления.Gender_recip.М;
		ИначеЕсли Выборка.Обучающийся.Пол = Перечисления.Пол.Женский Тогда 
			Строка.Gender_reason = Перечисления.Gender_recip.Ж; 
		КонецЕсли;
		Строка.BirthDate_reason = Выборка.Обучающийся.ДатаРождения;
		Если Выборка.Обучающийся.Документ = Перечисления.Документы.ПаспортГражданинаРФ Тогда
			Строка.doctype_reason = "03";
		ИначеЕсли Выборка.Обучающийся.Документ = Перечисления.Документы.СвидетельствоОРождении Тогда
			Строка.doctype_reason = "05";			
		КонецЕсли;
		Строка.doc_Series_reason = Выборка.Обучающийся.ДокументСерия;
		Строка.doc_Number_reason = Выборка.Обучающийся.ДокументНомер;
		Строка.doc_IssueDate_reason = Выборка.Обучающийся.ДатаВыдачиДокумента;
		Строка.doc_Issuer_reason = Выборка.Обучающийся.ДокументВыдан;
		Строка.decision_date = Выборка.ДатаПриказа;
		Строка.dateStart = Выборка.Начало;
		Строка.dateFinish = Выборка.Окончание; 
		Строка.usingSign = Перечисления.usingSign.Нет;
		Строка.criteria = ""; 
		Строка.FormCode = КатегорияЕГИССО.FormCode;
		Строка.amount = КатегорияЕГИССО.amount;
		Строка.measuryCode = КатегорияЕГИССО.measuryCode;
		Строка.monetization = Ложь;
		Строка.content = ""; 
		Строка.comment = "";
		Строка.equivalentAmount = Строка.amount; 
	КонецЦикла;
	
КонецПроцедуры
